core/src/InformationRegisters/Тренды/Тренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Тренды</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Изменение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Репозиторий</name>
    <type>
      <types>CatalogRef.Репозитории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

core/src/InformationRegisters/СтатистикаРепозиториев/СтатистикаРепозиториев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаРепозиториев</name>
  <resources>
    <name>Звезды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подписчики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Форки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрошлоеМесто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Репозиторий</name>
    <type>
      <types>CatalogRef.Репозитории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

core/src/InformationRegisters/ТрендыПоМесяцам/ТрендыПоМесяцам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТрендыПоМесяцам</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Звезды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Репозиторий</name>
    <type>
      <types>CatalogRef.Репозитории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

core/src/CommonModules/МетодыОбработкиДанных/Module.bsl
// Copyright (c) 2023-2025 Anton Tsitavets

// 
// This program is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
// 
// This program is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
// 
// You should have received a copy of the GNU General Public License
// along with this program.  If not, see <https://www.gnu.org/licenses/>.

// https://github.com/OpenBSL/OpenYellow

//@skip-check undefined-variable
//@skip-check bsl-legacy-check-string-literal

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьТрендыМесяца() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Тренды.Репозиторий КАК Репозиторий,
		|	СУММА(Тренды.Изменение) КАК Изменение,
		|	КОНЕЦПЕРИОДА(Тренды.Период, МЕСЯЦ) КАК Месяц
		|ПОМЕСТИТЬ Динамика
		|ИЗ
		|	РегистрСведений.Тренды КАК Тренды
		|
		|СГРУППИРОВАТЬ ПО
		|	Тренды.Репозиторий,
		|	КОНЕЦПЕРИОДА(Тренды.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Динамика.Месяц КАК Месяц
		|ПОМЕСТИТЬ Месяца
		|ИЗ
		|	Динамика КАК Динамика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатистикаРепозиториев.Репозиторий КАК Репозиторий,
		|	ДОБАВИТЬКДАТЕ(Месяца.Месяц, МЕСЯЦ, -1) КАК Месяц,
		|	СУММА(ЕСТЬNULL(Динамика.Изменение, 0)) КАК Динамика,
		|	СтатистикаРепозиториев.Звезды КАК Звезды
		|ПОМЕСТИТЬ Финальная
		|ИЗ
		|	Месяца КАК Месяца
		|		ЛЕВОЕ СОЕДИНЕНИЕ Динамика КАК Динамика
		|			ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатистикаРепозиториев КАК СтатистикаРепозиториев
		|			ПО Динамика.Репозиторий = СтатистикаРепозиториев.Репозиторий
		|		ПО Месяца.Месяц <= Динамика.Месяц
		|
		|СГРУППИРОВАТЬ ПО
		|	СтатистикаРепозиториев.Звезды,
		|	СтатистикаРепозиториев.Репозиторий,
		|	ДОБАВИТЬКДАТЕ(Месяца.Месяц, МЕСЯЦ, -1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Финальная.Репозиторий КАК Репозиторий,
		|	Финальная.Звезды - Финальная.Динамика КАК Звезды,
		|	Финальная.Месяц КАК Период
		|ПОМЕСТИТЬ ЗвездыПоМесяцам
		|ИЗ
		|	Финальная КАК Финальная
		|ГДЕ
		|	НЕ Финальная.Репозиторий ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗвездыПоМесяцам.Репозиторий КАК Репозиторий,
		|	ЗвездыПоМесяцам.Звезды КАК Звезды,
		|	ЗвездыПоМесяцам.Период КАК Период
		|ИЗ
		|	ЗвездыПоМесяцам КАК ЗвездыПоМесяцам
		|ГДЕ
		|	ЗвездыПоМесяцам.Период >= ЗвездыПоМесяцам.Репозиторий.ДатаДобавления";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	НЗаписей = РегистрыСведений.ТрендыПоМесяцам.СоздатьНаборЗаписей();
	НЗаписей.Загрузить(РезультатЗапроса);
	НЗаписей.Записать(Истина);
	
	Попытка
		МетодыВыгрзкиДанных.ВыгрузитьТренды();
	Исключение
		ИнструментарийВызовСервера.ЗаписатьИсключение(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
